<?php
define("DB_HOST", "localhost");
define("DB_USER", "username");
define("DB_PASS", "password");
define("DB_NAME", "resistance");

$roles=[
	5 => [3,2],
	6 => [4,2],
	7 => [4,3],
	8 => [5,3],
	9 => [6,3],
	10 => [6,4],
];

$tasks=[
	5 => [2,3,2,3,3],
	6 => [2,3,4,3,4],
	7 => [2,3,3,4,4],
	8 => [3,4,4,5,5],
	9 => [3,4,4,5,5],
	10 => [3,4,4,5,5],
];

$fails=[
	5 => [0,0,0,0,0],
	6 => [0,0,0,0,0],
	7 => [0,0,0,1,0],
	8 => [0,0,0,1,0],
	9 => [0,0,0,1,0],
	10 => [0,0,0,1,0],
];

$pattern_vote='/^[01]$/';
$pattern_create='/^([5-9]|10)$/';
$pattern_room='/^\d{4}$/';

$rolename=[
	FALSE => "抵抗者",
	TRUE => "间谍",
];

$document="游戏介绍：http://45.118.133.173/resistance.jpg\n1. 回复总人数(5-10)创建房间，获取房间号及自己的身份（抵抗者 vs 间谍）；\n2. 邀请基/姬友们回复房间号（四位阿拉伯数字）进入房间，并获取身份；\n3. 投票：1支持，0反对；\n4.任务阶段回复“反对”，推翻组队；\n5. 回复“退出”，房间所有人会被解除房间状态。";

?>
